## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.ai_answers will be created
  + resource "aws_acm_certificate" "ai_answers" {
      + arn                       = (known after apply)
      + domain_name               = "ai-answers.cdssandbox.xyz"
      + domain_validation_options = [
          + {
              + domain_name           = "*.ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "ai-answers.cdssandbox.xyz"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.ai-answers.cdssandbox.xyz",
          + "ai-answers.cdssandbox.xyz",
        ]
      + tags                      = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all                  = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options (known after apply)
    }

  # aws_acm_certificate_validation.ai_answers will be created
  + resource "aws_acm_certificate_validation" "ai_answers" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_lb_target_group.ai_answers will be created
  + resource "aws_lb_target_group" "ai_answers" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "ai-answers-production"
      + name_prefix                        = (known after apply)
      + port                               = 3001
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = "HTTP1"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCentre" = "ai-answers-prod"
        }
      + tags_all                           = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + target_type                        = "ip"
        # (1 unchanged attribute hidden)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = (known after apply)
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 30
          + unhealthy_threshold = 2
        }

      + stickiness (known after apply)

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "1234567890"
    }

  # aws_route53_record.ai_answers_certificate_validation["ai-answers.cdssandbox.xyz"] will be created
  + resource "aws_route53_record" "ai_answers_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "1234567890"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + lb_target_group_arn = (known after apply)
[0;90m17:57:43.307[0m [0;33mWARN  [0m Config ../hosted_zone/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
[0;90m17:57:43.355[0m [0;33mWARN  [0m Config ../network/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.

Error: "" is not a valid CIDR block: invalid CIDR address: 

  with aws_security_group.ai_answers_load_balancer_sg,
  on security_group.tf line 1, in resource "aws_security_group" "ai_answers_load_balancer_sg":
   1: resource "aws_security_group" "ai_answers_load_balancer_sg" {

[0;90m17:57:46.524[0m [0;31mERROR [0m terraform invocation failed in ./.terragrunt-cache/xfzfiIucoOoscpzSTkHagLWOmmo/HZ1Dre01zncVe6gY3u5Io4to-Mc/load_balancer
[0;90m17:57:46.524[0m [0;31mERROR [0m error occurred:

* Failed to execute "terraform plan -no-color -input=false -out=plan.tfplan" in ./.terragrunt-cache/xfzfiIucoOoscpzSTkHagLWOmmo/HZ1Dre01zncVe6gY3u5Io4to-Mc/load_balancer
  
  Error: "" is not a valid CIDR block: invalid CIDR address: 
  
    with aws_security_group.ai_answers_load_balancer_sg,
    on security_group.tf line 1, in resource "aws_security_group" "ai_answers_load_balancer_sg":
     1: resource "aws_security_group" "ai_answers_load_balancer_sg" {
  
  
  exit status 1


```

</details>

